
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.this will be created
  + resource "aws_eip" "this" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "demo_nat_gw_eip"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all             = {
          + "Name"        = "demo_nat_gw_eip"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "demo_ig"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all = {
          + "Name"        = "demo_ig"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_main_route_table_association.this will be created
  + resource "aws_main_route_table_association" "this" {
      + id                      = (known after apply)
      + original_route_table_id = (known after apply)
      + route_table_id          = (known after apply)
      + vpc_id                  = (known after apply)
    }

  # aws_nat_gateway.this will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"        = "demo_nat_gw"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all                           = {
          + "Name"        = "demo_nat_gw"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
    }

  # aws_route_table.main will be created
  + resource "aws_route_table" "main" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "10.0.0.0/16"
              + gateway_id                 = "local"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"        = "demo_main_rt"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Name"        = "demo_main_rt"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"        = "demo_private_rt"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Name"        = "demo_private_rt"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"        = "demo_public_rt"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Name"        = "demo_public_rt"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "demo_vpc"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
      + tags_all                             = {
          + "Name"        = "demo_vpc"
          + "environment" = "dev"
          + "project"     = "RS-School-task1"
          + "terraform"   = "true"
        }
    }

  # module.private_subnet["10.0.240.0/24"].aws_route_table_association.this will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.private_subnet["10.0.240.0/24"].aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.240.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo_private_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "demo_private_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.private_subnet["10.0.250.0/24"].aws_route_table_association.this will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.private_subnet["10.0.250.0/24"].aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.250.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo_private_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "demo_private_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.public_subnet["10.0.10.0/24"].aws_route_table_association.this will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.public_subnet["10.0.10.0/24"].aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo_public_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "demo_public_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.public_subnet["10.0.20.0/24"].aws_route_table_association.this will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.public_subnet["10.0.20.0/24"].aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "demo_public_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "demo_public_subnet"
          + "environment" = "stage"
          + "project"     = "demo"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.